[
    {
        "data": {
            "text": "Wall St. Bears Claw Back Into the Black (Reuters) Reuters - Short-sellers, Wall Street's dwindling\nband of ultra-cynics, are seeing green again."
        }
    },
    {
        "data": {
            "text": "Carlyle Looks Toward Commercial Aerospace (Reuters) Reuters - Private investment firm Carlyle Group,\nwhich has a reputation for making well-timed and occasionally\ncontroversial plays in the defense industry, has quietly placed\nits bets on another part of the aerospace market."
        }
    },
    {
        "data": {
            "text": "Oil and Economy Cloud Stocks' Outlook (Reuters) Reuters - Soaring crude prices plus worries about the\neconomy and the outlook for earnings are expected to hang over\nthe stock market next week during the depth of the summer\ndoldrums."
        }
    },
    {
        "data": {
            "text": "Iraq Halts Oil Exports from Main Southern Pipeline (Reuters) Reuters - Authorities have halted oil export\nflows from the main pipeline in southern Iraq after\nintelligence showed a rebel militia could strike the\ninfrastructure, an oil official said on Saturday."
        }
    },
    {
        "data": {
            "text": "Oil prices soar to all-time record, posing new threat to US economy (AFP) AFP - Tearaway world oil prices, toppling records and straining wallets, present a new economic menace just as the US economy is trying to find its feet."
        }
    },
    {
        "data": {
            "text": "Stocks End Up, But Near Year Lows (Reuters) Reuters - Stocks ended slightly higher on Friday\nbut stayed near lows for the year as oil prices surged past #36;46\na barrel, offsetting a positive outlook from computer maker\nDell Inc. (DELL.O)"
        }
    },
    {
        "data": {
            "text": "Money Funds Fell in Latest Week (AP) AP - Assets of the nation's retail money market mutual funds fell by #36;1.17 billion in the latest week to #36;849.98 trillion, the Investment Company Institute said Thursday."
        }
    },
    {
        "data": {
            "text": "Fed minutes show dissent over inflation (USATODAY.com) USATODAY.com - Retail sales bounced back a bit in July, and new claims for jobless benefits fell last week, the government said Thursday, indicating the economy is improving from a midsummer slump."
        }
    },
    {
        "data": {
            "text": "Safety Net (Forbes.com) Forbes.com - After earning a PH.D. in Sociology, Danny Sjursen became a working-class hero by solving a safety problem at a rubber factory."
        }
    },
    {
        "data": {
            "text": "Wall St. Bears Claw Back Into the Black (Reuters) Reuters - Short-sellers, Wall Street's dwindling\nband of ultra-cynics, are seeing green again."
        }
    },
    {
        "data": {
            "text": "Microsoft to begin selling stripped-down version of Windows XP in Asia (AFP) AFP - Microsoft said it would begin selling a cheaper, stripped-down version of its Windows XP operating system in five Asian countries in October."
        }
    },
    {
        "data": {
            "text": "P2P traffic tops Web, report says (CNET) CNET - Peer-to-peer applications, specifically eDonkey, now drive the most traffic on the Internet, according to a recent study."
        }
    },
    {
        "data": {
            "text": "IBM to Hire 18,800 workers this year (Reuters) Reuters - International Business Machines Corp. said on Thursday it planned to hire 18,800 people this year, most of them in its fast-growing services division."
        }
    },
    {
        "data": {
            "text": "Sun to Offer its 'Java Desktop System' to China (Reuters) Reuters - Sun Microsystems Inc. on Thursday said it\nhad signed an agreement with the Chinese government to supply\nmillions of copies of its desktop operating system and software\nin the world's most populous nation."
        }
    },
    {
        "data": {
            "text": "Wrapup: Phelps wins fifth gold, U.S. basketball stunned (Reuters) Reuters - Michael Phelps won his fifth gold medal of the Athens Olympics on Friday but the U.S. men's basketball team suffered another shock defeat."
        }
    },
    {
        "data": {
            "text": "Greek Sprinters Fail to Appear at Hearing (AP) AP - For the Greek people, the Athens Olympics were supposed to be a source of pride, an opportunity to show the world they could pull off a spectacularly successful games. In just a few short days, however, the mood has turned from celebration to shame."
        }
    },
    {
        "data": {
            "text": "Roddick into semi-finals in Cincinnati (AFP) AFP - Top seed Andy Roddick beat German Tommy Haas 6-3, 6-3 to reach the semi-finals of the 2.45 million dollar Cincinnati Masters tennis tournament."
        }
    },
    {
        "data": {
            "text": "U.S. Men's Basketball Team Beats Australia (AP) AP - The U.S. men's basketball team defeated Australia 89-79 Thursday to advance to the semifinals of the Olympic tournament. The Americans will play Argentina, which beat Greece 69-64."
        }
    },
    {
        "data": {
            "text": "Is this the end for the PC? (CNET) CNET - The PC is losing its dominance as the center of the digital home, according to a new report from Forrester Research."
        }
    },
    {
        "data": {
            "text": "Google IPO filing update indicates size of offering (MarketWatch) MarketWatch - Google updated its IPO filing Thursday morning with the Securities and Exchange Commission, indicating the company will sell 14.1 million shares and existing holders will sell 11.6 million shares."
        }
    }
]